simulations/snappyHex/constant/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          240;
        startFace       276770;
    }
    inlet
    {
        type            patch;
        nFaces          222;
        startFace       277010;
    }
    outlet
    {
        type            patch;
        nFaces          222;
        startFace       277232;
    }
    ellipse
    {
        type            wall;
        nFaces          196;
        startFace       277454;
    }
    back
    {
        type            empty;
        nFaces          138136;
        startFace       277650;
    }
    front
    {
        type            empty;
        nFaces          138136;
        startFace       415786;
    }
)

// ************************************************************************* //
