simulations/snappyHex/constant/neighbour
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelList;
    note        "nPoints:279028  nCells:138136  nFaces:553922  nInternalFaces:276770";
    location    "constant/polyMesh";
    object      neighbour;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


276770
(
1
60
2
61
3
62
4
63
5
64
6
65
7
66
8
67
9
68
22600
22600
22602
22602
22603
22605
7998
22606
22608
8001
22609
22611
8004
22612
22614
8007
22615
22617
8010
22618
22620
8013
22621
22623
8016
22624
22626
8019
22627
22629
8022
22630
22632
8025
22633
22635
8028
22636
22638
8031
22639
22641
8034
22642
22644
8037
22645
22647
8040
81112
81114
8043
81115
81117
8046
81118
81120
8049
81121
81123
8052
81124
81126
8055
81127
81129
8058
81130
81132
8061
81133
81135
8064
81136
81138
8067
81139
81141
8070
22678
...
)


// ************************************************************************* //
